import React, {Component} from 'react'
import {connect} from 'react-redux'
import {Router, Route, hashHistory, Link, browserHistory} from 'react-router'
import './tipsComponent.scss';
class TipsComponent8 extends React.Component{
	backHandle(){
                window.history.back();
    }
	render(){
		return(
			<div id='tips'>
				<div className='fhead'>
					<i className="iconfont icon-jiantou-copy" onClick={this.backHandle}></i>
					<span>女孩都喜欢别人送鲜花吗？</span>
				</div>	
				<div className='content'>
					<br/><h3>女孩都喜欢别人送鲜花吗？</h3><br/>
					<p>关于“女孩都喜欢别人送鲜花吗？”的议论——</p><br/>
					<p>*送花可以表达一种心情,一份爱意,同时表达的方式也有很多,只要你是真心喜欢她,付出总有回报,相信你会得到幸福的.</p><br/>
					<p>*并非所有的女孩子都喜欢男友送花的。女孩子分两类，一类是浪漫主义的，她们很喜欢男孩子送花给自己；另一类是现实主义的，她们会认为送花太浪费钱，不如把钱用在别的方面来得实在。但据我研究，所有的女孩子在收到心仪的男孩子的花之后，没有不高兴的，虽然她们可能表达形式不同。我女朋友就是现实主义那类型的，但我在她生日或情人节等重大节日送花给她的时候，她总是说我浪费钱，但我分明能 感觉到她的欣喜透过她的眉梢、她的微笑表现出来了。</p><br/>
					<p>*我不在乎有没有鲜花只是希望他是真城的...</p><br/>
					<p>*大多数女孩子都喜欢别人送鲜花，尤其在办公室众目睽睽之下收到鲜花的喜悦；还有最重要的那几个非送不可的节日，比如，情人节，她的生日等等如果你没送，罪过就大了，她会记得很牢，随时可以翻旧帐。但你也不能常送，那样就没新鲜感了。</p><br/>
					<p>*女孩子都喜欢花，即使不喜欢但是如果是男孩子送的也会很喜欢，很高兴。尤其是那几个最特别的日子，因为花是一种情感的代表。</p><br/>
					<p>*一般情况女孩子们对熟悉的人送的花都很喜爱，如朋友恋人及爱人。对刚刚认识的人所送的花比较惊喜，也会喜欢。但对于花过敏的人就变成坏事。所以，要送女孩花时，一定要明白她是否对花过敏。</p><br/>
					<p>*喜欢，一是来自内心的喜欢，二是来自虚荣心的喜欢，三是知道你在乎她感动的喜欢。当然如果她很爱你，那么也许会不在乎你是否送了她喜欢的花，而是你是否在该送花的时候送了花给她。</p><br/>
					<p>*并不是每个女孩子都喜欢送花.其实你送一束花给她还不如给她多一点的关心.但这也要因人而异了.</p><br/>
					<p>*我想所有的女孩都是爱美的，不管自身是什么样的，最基本的审美观都使得她们爱漂亮的、美丽的、可爱的东西，男人不也是如此吗？他们也是喜欢美丽的、漂亮的女孩，因此我觉得女孩都喜欢花，特别是漂亮的花，即使女孩口中不说喜欢花，但心里也是很想有人送最漂亮的花，所以不管你送什么样的花给她，只要用你的心意表达你的好感，用你觉得最美丽的花去送给你所喜欢的女孩，她一定会接受的，祝你好运！</p><br/>
					<p>*送花可以，但要在特别的日子，有纪念的日子来点浪漫是非常幸福的。平常的日子里，还是来点实在的，用心去关心她，呵护她，用真情去爱她，我想她会觉的更幸福。 </p><br/>
					<p>*女孩大都喜欢收到花,不过喜不喜欢你就不是看收不收到花决定的,她要是喜欢你就算不收到花也一样喜欢你,花只是一种情趣 </p><br/>
					<p>*也不是的，但是喜欢花的女孩肯定是个爱美浪漫的女孩。 </p><br/>
					<p>*锦上添花嘛,要有感情基础才有用.花只是陪衬,所代表的也只是你的心意.爱美之心人皆有之.花是美丽的象征女人当然喜欢花.所以你在她喜欢你的花的同时也努力让她更喜欢你不就更好了.</p><br/>
					<p>*不是每个人都喜欢花！就像现实社会主义的人来说吧，你给她越多越贵！她反而认为你很奢侈！但追求浪漫的人又不同，她们往往虚荣心很强！你送得越多她越开心，所以抓住她的性格是最重要的！现在的社会不是什么都可以用金钱就能解决事情！最主要的是你一颗真诚的心，这比什么都要重要！</p><br/>
					<p>*如果你是在人多的场合(尤其都是她朋友)那是一定要送花的 女孩子都有点小小的虚荣心嘛；如果只是你门私下约会,那就送点她平时喜欢的东西就好，不过要追上她 一定是要用心去打动她的 用花就能打动的女孩子你就要慎重考虑了。。</p><br/>

					<br/>
				</div>
			</div>		
		)
	}
}
export default TipsComponent8;