import React, {Component} from 'react'
import {connect} from 'react-redux'
import {Router, Route, hashHistory, Link, browserHistory} from 'react-router'
import './tipsComponent.scss';
class TipsComponent2 extends React.Component{
	backHandle(){
                window.history.back();
    }
	render(){
		return(
			<div id='tips'>
				<div className='fhead'>
					<i className="iconfont icon-jiantou-copy" onClick={this.backHandle}></i>
					<span>不同颜色和枝朵的百合有不同意义</span>
				</div>
				<div className='content'>
					<br/><h3>不同颜色和枝朵的百合有不同意义</h3><br/>
					<p> 百合花素有“云裳仙子”之称。由于其外表高雅纯洁，
					天主教以百合花为玛利亚的象征，而梵蒂冈、法国以百合花为国花。
					百合的 种头由鳞片抱合而成，取“百年好合”“百事合意”之意，
					中国自古视为婚礼必不可少的吉祥花卉。百合花的花名是为了纪念圣母玛利亚
					，自古以来圣母就被基督教 视为清纯的象征，因此它的花语就是纯洁
					（出现在“天使报喜”中），也是上帝圣父与基督的象征，
					还是品德高洁的圣徒尤其是圣女的象征。法国卡佩王朝为求圣母保佑
					，亦采用百合花为其王徽。</p><br/>
					<p>在中国百合具有百年好合美好家庭、伟大的爱之含意，
					有深深祝福的意义。受到这种花的祝福的人具有清纯天真的性格，
					集众人宠爱于一身，不过光凭这一点并不能平静度过一生，必须具备自制力，
					抵抗外界的诱惑，才能保持不被污染的纯真。</p><br/>
					<p>百合鲜花</p><br/>
					<h3>不同颜色百合的含义：</h3><br/>
					<p>白百合：象征百年好合、伟大的爱</p><br/>
					<p>粉百合：象征清纯、高雅</p><br/>
					<p>黄百合：象征财富、高贵</p><br/>
					<p>黑百合：恋、诅咒</p><br/>
					<h3>不同品种百合的花语：</h3><br/>
					<p>百合（所有的百合）：顺利、心想事成、祝福、高贵 </p><br/>
					<p>香水百合：纯洁、婚礼的祝福、高贵</p><br/>
					<p>白百合：纯洁、庄严、心心相印</p><br/>
					<p>粉百合：纯洁、可爱</p><br/>
					<p>红百合：永远爱你</p><br/>
					<p>黄百合：早日康复</p><br/>
					<p>葵百合：胜利、荣誉、富贵 </p><br/>
					<p>姬百合：财富、荣誉、清纯、高雅 </p><br/>
					<p>野百合：永远幸福</p><br/>
					<p>狐尾百合：尊贵、欣欣向荣、杰出 </p><br/>
					<p>玉米百合：执著的爱、勇敢</p><br/>
					<p>编笠百合：才能、威严、杰出·尊贵，高雅</p><br/>
					<p>圣诞百合：喜洋洋、庆祝、真情 </p><br/>
					<p>水仙百合：喜悦、期待相逢</p><br/>
					<h3>百合在朵数上的讲究：</h3><br/>
					<p>1朵，你是我的惟一</p><br/>
					<p>2朵，你侬我侬，祝我你幸福 </p><br/>
					<p>3朵，我爱你，请原谅我 </p><br/>
					<p>4朵，山盟海誓，山盟海誓，似曾相识 </p><br/>
					<p>5朵，无怨无悔</p><br/>
					<p>6朵，祝你一切顺利</p><br/>
					<p>7朵，喜相逢，祝你幸福</p><br/>
					<p>8朵，弥补，请原谅我</p><br/>
					<p>9朵，长长久久，长相厮守，相爱到永远</p><br/>
					<p>10朵，十全十美，十全十美</p><br/>
					<p>11朵，爱情 一心一意 最美</p><br/>
					<p>12朵，心心相印 </p><br/>
					<p>13朵，暗恋的人 </p><br/>
					<p>14朵，成长的喜悦 </p><br/>
					<p>15朵，守住你的人</p><br/>
					<p>16朵，成长的喜悦</p><br/>
					<p>17朵，好聚好散，让爱结束吧 </p><br/>
					<p>19朵，一生守候 </p><br/>
					<p>20朵，两情相悦 矢志不渝 </p><br/>
					<p>30朵，不需要言语的爱 </p><br/>
					<p>50朵，这是无悔的爱</p><br/>
					<p>66朵，情场顺利 情场顺利</p><br/>
					<p>77朵，有缘相逢 嫁给我吧 </p><br/>
					<p>88朵，用心弥补一切的错</p><br/>
					<p>99朵，天长地久</p><br/>
					<p>100朵，百份百的爱 白头偕老 白头偕老</p><br/>
					<p>101朵，你是我的惟一</p><br/><br/>

				</div>
			</div>
		)
	}
}
export default TipsComponent2;